{
  "results": [
    {
      "id": "1412",
      "title": "Arrow",
      "description": "Spoiled billionaire playboy Oliver Queen is missing and presumed dead when his yacht is lost at sea. He returns five years later a changed man, determined to clean up the city as a hooded vigilante armed with a bow.",
      "release_date": "October 10, 2012",
      "imagePath": "https://image.tmdb.org/t/p/w185_and_h278_bestv2/gKG5QGz5Ngf8fgWpBsWtlg5L2SF.jpg"
    },
    {
      "id": "44217",
      "title": "Vikings",
      "description": "The adventures of Ragnar Lothbrok, the greatest hero of his age. The series tells the sagas of Ragnar's band of Viking brothers and his family, as he rises to become King of the Viking tribes. As well as being a fearless warrior, Ragnar embodies the Norse traditions of devotion to the gods. Legend has it that he was a direct descendant of Odin, the god of war and warriors.",
      "release_date": "March 3, 2013",
      "imagePath": "https://image.tmdb.org/t/p/w185_and_h278_bestv2/ff1zhqvwfS5HvRNcA5UFrH0PA2q.jpg"
    },
    {
      "id": "4057",
      "title": "Criminal Minds",
      "description": "An elite team of FBI profilers analyze the country's most twisted criminal minds, anticipating their next moves before they strike again. The Behavioral Analysis Unit's most experienced agent is David Rossi, a founding member of the BAU who returns to help the team solve new cases.",
      "release_date": "September 22, 2005",
      "imagePath": "https://image.tmdb.org/t/p/w185_and_h278_bestv2/7TCwgX7oQKxcWYEhSPRmaHe6ULN.jpg"
    },
    {
      "id": "69050",
      "title": "Riverdale",
      "description": "Set in the present, the series offers a bold, subversive take on Archie, Betty, Veronica and their friends, exploring the surreality of small-town life, the darkness and weirdness bubbling beneath Riverdale’s wholesome facade.",
      "release_date": "January 26, 2017",
      "imagePath": "https://image.tmdb.org/t/p/w185_and_h278_bestv2/4X7o1ssOEvp4BFLim1AZmPNcYbU.jpg"
    },
    {
      "id": "4614",
      "title": "NCIS",
      "description": "From murder and espionage to terrorism and stolen submarines, a team of special agents investigates any crime that has a shred of evidence connected to Navy and Marine Corps personnel, regardless of rank or position.",
      "release_date": "September 23, 2003",
      "imagePath": "https://image.tmdb.org/t/p/w185_and_h278_bestv2/fi8EvaWtL5CvoielOjjVvTr7ux3.jpg"
    }
  ]
}